package edu.itstep.cw20220929_repeat.Ex1;

import javax.swing.*;
import java.awt.*;

public class Main {
    public static void main(String[] args) {
        FirstFrame firstFrame = new FirstFrame();

        firstFrame.setVisible(true); // метод робить вікно видимим - ОБОВ'ЯЗКОВО

        firstFrame.setDefaultCloseOperation(WindowConstants.EXIT_ON_CLOSE); // встановлення дії при закритті вікна
        // (вийти при закритті вікна)
        // приймає одну з констант, що зберігаються у інтерфейсі WindowConstants

        // =============================================================================================================
        // встанволення розмірів вікна
        //firstFrame.setSize(250, 250); // при запуску вікно має рохміри, вказані у параметрах у пікселях - X, Y
        // вікно відкривається у лівому верхньому кутку - дефолтні параметри положення встановлені нульовими

        // =============================================================================================================
        //firstFrame.setBounds(100, 100, 250, 250); // метод встановлює координати положення
                                                                    // вікна при запуску, а також його розміри
        // використовуючи метод setBounds можна вирахувати центральне положення вікна - для отримання розмірів монітора
        // використовується інструмент Toolkit (абстрактний клас, використовується за доп фабричного метода)
        // , а також об'єжкт Dimension - складний обєкт, що зберігає дані про ширину та висоту
        Toolkit toolkit = Toolkit.getDefaultToolkit();
        Dimension dimension = toolkit.getScreenSize(); // Dimension - складний обєкт, що зберігає дані про ширину та висоту
        System.out.println(dimension.width);
        System.out.println(dimension.height);
        //firstFrame.setBounds(dimension.width / 2 - 150, 0, 300, 300); // розміщення вікна посередині ширини екрана

        // для розміщення вікна посередині украна існує метод setSize() + setLocationRelativeTo(null)
        firstFrame.setSize(300, 300); // задає розміри
        firstFrame.setLocationRelativeTo(null); // задає положення

        // =============================================================================================================
        // встановлення тексту заголовку
        firstFrame.setTitle("Calculator");

        // =============================================================================================================
        // встановлення іконки
        //firstFrame.setIconImage(Image image - абстрактний клас);
    }
}
