package edu.itstep.cw20221207a2;

import java.util.List;

import retrofit2.Call;
import retrofit2.http.GET;
import retrofit2.http.Path;

public interface PlaceholderAPI {

    // Інтерфейс містить опис методів, які будуть використовуватись,
    // їх реалізацію робити не потрібно, це зробить Retrofit
    // Застосовані анотації є підказками для Retrofit - що саме потрібно робити при виклику конкретного метода

    @GET("/posts") // вказує який саме запит викликатиме даний метод
    Call<List<Post>> getAllPosts(); // отримання усіх постів - повертає спеціальний об'єкт Call (виклик), типізований даними, які мають повертатись
    // Об'єкт Call (виклик) - відповідає за те, щоб зробити запит - потрібен для здійснення запиту на сервер

    @GET("/posts/{id}") // вказує який саме запит викликатиме даний метод
    Call<Post> getPostById(@Path("id")long postId); // отримання поста за id
    // @Path("id") - зв'язує параметр та змінну у анотації, що визначає вид запиту -
    // для передачі id з параметрів методу до запиту
    // Об'єкт Call (виклик) - відповідає за те, щоб зробити запит - потрібен для здійснення запиту на сервер, типізований даними, які мають повертатись
}
