package org.example.ex12;

import org.springframework.context.annotation.ComponentScan;
import org.springframework.context.annotation.Configuration;

@Configuration // на клас, що виконує роль конфігураційного файлу (при цьому конфігураційний файл XML відсутній !!!)
//@ComponentScan // на клас, вказує який каталог потрібно сканувати на належність компонентів, приймає параметр – рядок, шлях до пекеджу, який потрібно сканувати, якщо параметр відсутній скануватиметься пекедж в якому знаходиться даний клас
@ComponentScan("org.example.ex12") // на клас, вказує який каталог потрібно сканувати на належність компонентів, приймає параметр – рядок, шлях до пекеджу, який потрібно сканувати, якщо параметр відсутній скануватиметься пекедж в якому знаходиться даний клас
public class MyConfig {

}
